{
  "backend/main.mo": "Defines the backend actor with access control, storage mixins, and data models for users, posts, messages, institutions, outreach, monitoring, and mental‑health features.",
  "feature_evidence.json": "Feature evidence record describing removal of a share button in the header and listing related files, components, tests, and confidence.",
  "frontend-file-summaries.txt": "Contains prewritten summaries of multiple frontend files including pages, components, hooks, and utilities for the application.",
  "frontend/index.css": "Tailwind-based global stylesheet defining OKLCH color variables and theme tokens for light and dark modes.",
  "frontend/index.html": "Base HTML file mounting the React app and loading the main TypeScript entrypoint.",
  "frontend/src/App.tsx": "Main app component handling identity, admin assignment, login recording, routing, layout, and conditional dialogs/banners.",
  "frontend/src/components/AdminPromotionBanner.tsx": "UI banner that notifies the user they were promoted to admin with a dismiss button.",
  "frontend/src/components/BreathingAnimation.tsx": "Animated breathing exercise component with expanding/contracting orb and synchronized text prompts.",
  "frontend/src/components/community/CommunityPostCard.tsx": "Renders a community post with edit and delete options, including content moderation checks and timestamp formatting.",
  "frontend/src/components/Footer.tsx": "Footer displaying attribution text and the ShareWebsiteDialog trigger control.",
  "frontend/src/components/Header.tsx": "Provides the main navigation header with authentication controls, responsive menus, and dynamic nav items based on user role and login state.",
  "frontend/src/components/outreach/OutreachInteractiveMap.tsx": "Shows an interactive outreach map with filtered markers, satellite toggle, and basic grid‑based visualization.",
  "frontend/src/components/ProfileSetupDialog.tsx": "Displays a required profile setup form with validation and submits user details to the backend.",
  "frontend/src/components/ShareWebsiteDialog.tsx": "Offers a share dialog that opens platform‑specific share links or copies the site URL for unsupported platforms.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor tied to the user's identity and invalidates related queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for Internet Identity authentication, handling login, identity loading, and status tracking.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for interacting with backend actor methods, including user profiles, admin checks, community posts, and role assignments.",
  "frontend/src/index.css": "Tailwind CSS configuration defining theme variables, dark mode styles, base styles, and custom scrollbars.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClientProvider and InternetIdentityProvider before rendering App.",
  "frontend/src/pages/CommunityPage.tsx": "Renders community posts, allows authenticated users to create posts with content checks, and supports admin/user editing and deletion.",
  "frontend/src/pages/GuidelinesPage.tsx": "Displays community guidelines including principles, acceptable conduct, prohibited behaviors, and safety rules.",
  "frontend/src/pages/HelplinePage.tsx": "Shows emergency helplines and online mental health resources with styled informational cards.",
  "frontend/src/pages/HomePage.tsx": "Renders the main landing page with a hero section, breathing animation, and clickable feature cards for navigation.",
  "frontend/src/pages/MessagesPage.tsx": "Implements user and admin messaging with conversations, message sending, reading, and dialog-based UI.",
  "frontend/src/pages/MoodTrackerPage.tsx": "Allows users to log moods and view recent history, requiring authentication for recording entries.",
  "frontend/src/pages/OutreachDashboardPage.tsx": "Provides an admin-focused dashboard for managing reported areas, institutions, monitoring, outreach camps, and analytics.",
  "frontend/src/pages/StressQuizPage.tsx": "Presents a multi-step stress quiz, records responses, and displays results based on computed stress scores.",
  "frontend/src/pages/TherapyPage.tsx": "React page providing therapy and wellness resources with tabbed content and a form to submit therapy session requests via authenticated users.",
  "frontend/src/utils/outreachMapLinks.ts": "Utility functions to generate Google and Apple Maps URLs from coordinates and open them in a new tab.",
  "frontend/src/utils/urlParams.ts": "Helpers for reading URL parameters, storing them in sessionStorage, and managing persisted or hash-based parameters.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending colors, animations, containers, and enabling typography, container-queries, and animate plugins.",
  "project_state.json": "Project metadata summarizing features for an ICP-based mental‑health app including authentication, community feed, admin tools, and outreach systems."
}