{
  "backend/main.mo": "Defines the backend actor with authorization mixins, counters, data models for users, posts, messaging, outreach, institutions, and various maps for storing application state.",
  "feature_evidence.json": "Contains feature evidence metadata linking the edit-permissions change to specific frontend files and components.",
  "frontend-file-summaries.txt": "Provides prewritten summaries of key frontend files, describing routing, pages, hooks, components, styling, and admin/outreach features.",
  "frontend/index.css": "Defines Tailwind base, component, and utility layers with OKLCH theme variables for light and dark modes.",
  "frontend/index.html": "Basic HTML entry point loading the root div and main React script.",
  "frontend/src/App.tsx": "Main React app handling authentication, routing, admin auto-assignment, login tracking, and layout composition.",
  "frontend/src/components/AdminPromotionBanner.tsx": "UI banner component that notifies users when they are promoted to admin with dismiss support.",
  "frontend/src/components/BreathingAnimation.tsx": "Animated breathing exercise component alternating inhale/exhale visuals and text using timed transitions.",
  "frontend/src/components/community/CommunityPostCard.tsx": "Card displaying a community post with edit/delete actions, content checks, and timestamp formatting.",
  "frontend/src/components/Footer.tsx": "Footer component with attribution, share dialog, and navigation support.",
  "frontend/src/components/Header.tsx": "Header component with navigation, login/logout handling via Internet Identity, and responsive mobile menu.",
  "frontend/src/components/outreach/OutreachInteractiveMap.tsx": "Interactive map view listing outreach markers with simple grid visualization, marker selection, and satellite toggle.",
  "frontend/src/components/ProfileSetupDialog.tsx": "Dialog for creating a user profile with form validation and a save-profile mutation.",
  "frontend/src/components/ShareWebsiteDialog.tsx": "Dialog providing buttons to share the site via social platforms or copy the link.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and manages a backend actor based on Internet Identity, reinitializing and invalidating queries on identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for managing Internet Identity authentication, exposing identity, login, logout, and status helpers. Includes helper to create AuthClient with default options.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for interacting with backend actors, including profile management, admin checks, community posts, role assignment, and other domain-specific queries and mutations.",
  "frontend/src/index.css": "Sets global Tailwind styles and CSS variables for a themed light/dark UI, including scrollbar styling and color definitions.",
  "frontend/src/main.tsx": "Initializes the React app, wrapping it with QueryClientProvider and InternetIdentityProvider before rendering App.",
  "frontend/src/pages/CommunityPage.tsx": "Implements the community forum page with post creation, content checking, listing, and permission logic for editing and deleting posts.",
  "frontend/src/pages/GuidelinesPage.tsx": "Displays community guidelines fetched from the backend, organizing them into themed UI sections with icons.",
  "frontend/src/pages/HelplinePage.tsx": "Renders a list of emergency helplines and online resources with styled cards and an emergency alert section.",
  "frontend/src/pages/HomePage.tsx": "Renders the landing page with a hero section, breathing animation, and a feature grid that navigates to other app sections.",
  "frontend/src/pages/MessagesPage.tsx": "Implements user messaging with conversations, sending messages, marking as read, and admin support features.",
  "frontend/src/pages/MoodTrackerPage.tsx": "Provides mood selection, logs user mood entries, and displays recent mood history with authentication checks.",
  "frontend/src/pages/OutreachDashboardPage.tsx": "Admin-focused dashboard for managing reported areas, institutions, monitoring, outreach camps, and viewing analytics.",
  "frontend/src/pages/StressQuizPage.tsx": "Runs a multi‑step stress quiz, captures user answers, submits results, and displays stress levels with suggestions.",
  "frontend/src/pages/TherapyPage.tsx": "React page presenting therapy and wellness resources with tabs and a form for submitting therapy session requests using authenticated user identity.",
  "frontend/src/utils/outreachMapLinks.ts": "Utility functions to generate Google/Apple Maps URLs from coordinates and open them in a new tab.",
  "frontend/src/utils/urlParams.ts": "Helpers for reading URL parameters, persisting them in sessionStorage, and clearing them from URL or storage.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining theme extensions, colors, animations, and plugin setup.",
  "project_state.json": "Project metadata describing the app's features, architecture, and current implemented functionality."
}