{
  "schemaVersion": "1.0.0",
  "projectStateVersion": 3,
  "summary": "From Stigma to Support is an Internet Computer (ICP) web application for academic wellness and mental-health support. It uses Internet Identity for authentication and a Motoko canister backend with role-based access control. The app provides user profile onboarding, an anonymous-capable community feed (create/list/edit/delete with basic content checks and admin moderation controls), mood tracking, a stress assessment quiz with saved results, therapy/wellness resources with session-request submission, an emergency helpline/resources page, and a polling-based direct messaging system with read receipts (plus an admin “all messages” view). Admins also get an Outreach Dashboard for rural mental-health outreach operations: reporting and monitoring regions, institutional mapping, outreach camp scheduling, analytics/intelligence views, coordinate-based map visualization, user role assignment, active user tracking, and unique-login counting. The backend additionally includes a blob-storage maintenance mixin for gateway authorization, dead-blob pruning, and cycles refill operations.",
  "existing_features": [
    {
      "id": "IF-1",
      "title": "Internet Identity authentication (login/logout) with persisted sessions",
      "synonyms": [
        "ICP Internet Identity login",
        "AuthClient session"
      ],
      "description": "Users authenticate via Internet Identity using AuthClient. The provider loads a stored identity on app startup, exposes login/logout actions, and maintains login status flags for UI gating.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-2",
      "title": "Backend actor initialization (anonymous vs authenticated) with access-control bootstrap",
      "synonyms": [
        "Actor hook",
        "Authenticated/anonymous actor"
      ],
      "description": "Frontend creates an anonymous actor when not logged in and an identity-bound actor when authenticated. On authenticated actor creation it calls a backend initializer that uses an env-provided admin token plus a user-provided secret (from URL hash/session) to register roles.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-3",
      "title": "Role-based access control (admin/user/guest) and role assignment",
      "synonyms": [
        "AccessControl",
        "RBAC",
        "assignUserRole"
      ],
      "description": "Motoko backend maintains user roles and enforces permissions. Admins can assign roles to principals; callers can query whether they are admin and retrieve their role.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-4",
      "title": "Admin bootstrap & auto-promotion flow after login",
      "synonyms": [
        "checkAndAssignAdmin",
        "Admin Mode Activated banner"
      ],
      "description": "After successful authentication, the frontend calls a backend method that may promote the user to admin and then refreshes admin status. UI can display an admin-promotion banner and toast notification.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-5",
      "title": "User profile onboarding and storage",
      "synonyms": [
        "Profile setup dialog",
        "saveCallerUserProfile"
      ],
      "description": "Authenticated users create and save a profile (email, name, username, age). The UI enforces basic validation and requires agreement to guidelines before submission; profiles can be fetched later.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-6",
      "title": "Community posts feed (list & create) with anonymity flag",
      "synonyms": [
        "Community Support page",
        "Anonymous posting"
      ],
      "description": "Users can create posts with an anonymity toggle; posts are stored with timestamps, author principal, and a moderation flag. The frontend lists all posts and sorts them by recency.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-7",
      "title": "Community post editing and deletion with author/admin permissions",
      "synonyms": [
        "Edit post",
        "Delete post",
        "Post moderation controls"
      ],
      "description": "Post authors can edit/delete their own posts and admins can edit/delete any post. The UI conditionally shows Edit/Delete actions per post and uses confirmation UI for deletion; backend enforces authorization.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-8",
      "title": "Content checking for community posts (basic inappropriate-word filter)",
      "synonyms": [
        "checkContent",
        "Bad-words filter"
      ],
      "description": "Before creating or saving an edited post, the frontend calls a backend content-check endpoint that rejects text containing configured bad words.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-9",
      "title": "Community guidelines retrieval and display",
      "synonyms": [
        "Guidelines page",
        "Safety rules"
      ],
      "description": "Frontend fetches a CommunityGuidelines object and renders core principles, acceptable conduct, prohibited behaviors, safety guidelines, and posting rules.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-10",
      "title": "Therapy & wellness resources hub (static content)",
      "synonyms": [
        "Therapy page",
        "Relaxation / art / music / physiotherapy resources"
      ],
      "description": "A tabbed UI provides mental-wellness guidance across multiple modalities (relaxation/breathing, art therapy, music therapy, physiotherapy).",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-11",
      "title": "Therapy session request submission",
      "synonyms": [
        "createTherapySessionRequest",
        "Request a session"
      ],
      "description": "Authenticated users can submit a therapy session request (type + details) from the Therapy page; backend stores the request with a timestamp.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-12",
      "title": "Mood tracking (record mood and view history)",
      "synonyms": [
        "Mood Tracker",
        "Mood entries"
      ],
      "description": "Authenticated users can add mood entries and view recent mood history with timestamps; the UI provides predefined mood choices with icons and displays recent entries plus basic insights.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-13",
      "title": "Stress assessment quiz with saved results",
      "synonyms": [
        "Stress Quiz",
        "submitStressQuiz"
      ],
      "description": "Multi-step stress quiz records per-question answers, computes a score, displays a stress level with suggestions, and persists results in the backend so prior results can be shown later.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-14",
      "title": "Emergency helpline and online resources page",
      "synonyms": [
        "Helpline page",
        "Crisis resources"
      ],
      "description": "Static frontend page listing crisis helplines and external mental-health resources with emergency disclaimers and outbound links.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-15",
      "title": "Direct messaging system with polling and read receipts",
      "synonyms": [
        "Messages",
        "DMs",
        "markMessageAsRead"
      ],
      "description": "Authenticated users can send messages to a principal, view their messages grouped into conversations, and mark received messages as read; UI polls periodically for updates and displays read status on sent messages.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-16",
      "title": "Admin global messages view",
      "synonyms": [
        "All Messages (Admin)",
        "Moderation messaging view"
      ],
      "description": "Admins can fetch and browse all messages system-wide in an admin-only tab, enabling oversight of conversations and support-marked messages.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-17",
      "title": "Active user tracking (backend) with admin visibility",
      "synonyms": [
        "updateUserActivity",
        "getActiveUsers"
      ],
      "description": "Backend records per-user activity timestamps on key actions and via an explicit endpoint; admins can query active users for operational monitoring.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-18",
      "title": "Unique login tracking and admin-only count display",
      "synonyms": [
        "recordSuccessfulLogin",
        "getUniqueLoginsCount"
      ],
      "description": "On successful login, the frontend records an authenticated login event; admins can retrieve and display the count of unique authenticated principals that have logged in.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-19",
      "title": "Rural area reporting and admin campaign updates",
      "synonyms": [
        "Reported areas",
        "reportArea",
        "updateAreaCampaigns"
      ],
      "description": "Users can report underserved regions with connectivity status, description, linked campaigns, mental-health support availability, and coordinates; admins can view reports and update linked campaigns per region.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-20",
      "title": "Institutional awareness mapping (admin CRUD) with coordinates",
      "synonyms": [
        "Institutions module",
        "addInstitution/updateInstitution"
      ],
      "description": "Admins can add and update institutions with type, region, contact info, infrastructure status, awareness rating, related campaigns, and coordinates; data is used in dashboard views and map markers.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-21",
      "title": "Rural/low-access area monitoring (admin CRUD) with heatmap and map/list view",
      "synonyms": [
        "Area monitoring",
        "Heatmap visualization"
      ],
      "description": "Admins can add/update monitored areas with access level, connectivity status, description, campaigns, and coordinates. The UI provides a heatmap-like visualization plus a map/list toggle and network-strength-based fallback to list view.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-22",
      "title": "Offline outreach camp scheduling (admin CRUD) with clinician assignment",
      "synonyms": [
        "Outreach camps",
        "Camp scheduling"
      ],
      "description": "Admins can schedule and update outreach camps including dates, event type, status, optional clinician principal assignment, description, and coordinates.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-23",
      "title": "Outreach dashboard analytics & intelligence views (admin-only)",
      "synonyms": [
        "getDashboardAnalytics",
        "Intelligence dashboard"
      ],
      "description": "Backend provides aggregate metrics (institutions, monitored areas, camps, campaigns, awareness averages, distressed/low-access regions, upcoming events). The admin UI displays these metrics plus alert/recommendation sections.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-24",
      "title": "Interactive outreach map visualization with external map links",
      "synonyms": [
        "OutreachInteractiveMap",
        "Google/Apple Maps links"
      ],
      "description": "Frontend renders a simplified interactive map showing markers for institutions, monitored areas, camps, and reported areas with coordinates; supports selecting markers, satellite/standard toggle, and opening locations in Google Maps or Apple Maps.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-25",
      "title": "Share website dialog",
      "synonyms": [
        "Social sharing",
        "Copy link"
      ],
      "description": "A dialog provides sharing actions for WhatsApp, Facebook, Twitter/X, and Instagram (copy link), generating platform-specific share URLs and using clipboard copy where needed.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-26",
      "title": "Calming breathing animation component",
      "synonyms": [
        "Breathing orb",
        "Relaxation animation"
      ],
      "description": "Animated breathing UI alternates inhale/exhale states on a timed interval with smooth transitions and instructional text, integrated on the home page to encourage calming techniques.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-27",
      "title": "SPA shell: navigation, layout, and theming",
      "synonyms": [
        "Header/Footer navigation",
        "Manual routing",
        "Dark mode"
      ],
      "description": "The app uses a shared layout with Header/Footer, manually routed pages via app state, auth/admin-gated navigation items, global toast notifications, and light/dark theme switching via next-themes.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-28",
      "title": "Blob storage maintenance endpoints (gateway auth, dead-blob pruning, cycles refill)",
      "synonyms": [
        "Caffeine storage mixin",
        "Dead blob GC",
        "Cashier top-up"
      ],
      "description": "Backend includes a storage maintenance mixin that can sync authorized gateway principals, list/prune dead blobs (with a GC trigger), check blob liveness, and perform cycles refill/top-up operations guarded by a cashier principal env var.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "feature-remove-the-share-option-ui-control-rendered-in-the-app-header-the-sharewebsitedialog-trigger-button-and-keep-the-rest-of-the-header-layout-behavior-unchanged",
      "title": "Remove the Share option UI control rendered in the app header (the ShareWebsiteDialog trigger button) and keep the rest of the header layout/behavior unchanged.",
      "reqIds": [
        "REQ-1"
      ],
      "version": 1
    }
  ],
  "new_feature_requests": [
    {
      "id": "AR-1",
      "summary": "Remove only the website sharing option (WhatsApp/Facebook/Instagram/Twitter/Messenger); keep everything else unchanged.",
      "reqIds": [],
      "status": "pending"
    }
  ],
  "architectural_notes": [
    "ICP canister backend implemented in Motoko, exposing query/shared methods consumed by a React SPA via an autogenerated actor interface.",
    "Authentication via Internet Identity (AuthClient + DelegationIdentity) provided through a React context, with persisted identity loading on app startup.",
    "Frontend creates an anonymous or identity-bound backend actor; on authenticated actor creation it calls a backend access-control initialization method using an env-protected admin token plus a user-provided secret.",
    "Role-based access control (admin/user/guest) is enforced server-side through an AccessControl module; endpoints trap on unauthorized access.",
    "Frontend data access uses @tanstack/react-query with principal-scoped query keys and mutation-triggered cache invalidation.",
    "Manual client-side page routing is implemented via React state (no react-router), with Header/Footer navigation and auth/admin-gated nav items.",
    "Near-real-time UX is achieved via polling (react-query refetchInterval) for messaging and active-user lists.",
    "Admin Outreach Dashboard is a tabbed, dialog-driven management UI integrating CRUD workflows and analytics views (including map/list modes).",
    "UI is built with TailwindCSS and shadcn/ui-style components; theme switching uses next-themes for light/dark modes.",
    "Blob storage maintenance endpoints are provided via a Motoko mixin (gateway principal sync, dead blob enumeration/pruning, and cashier cycles top-ups)."
  ],
  "known_issues": [
    "Motoko collection mutation semantics may be incorrect: List.add(...) and Set.add(...) are used without clearly capturing returned values; if these structures are persistent/immutable in mo:core, mood history, message conversation indexes, and unique login tracking may not persist as intended.",
    "addMoodEntry overwrites existing mood history and appears to duplicate the newest entry (creates a list with entry and then adds entry again), so users may not see a real history over time.",
    "sendMessage updates userConversations using List.add on an existing list without re-inserting it into the map; depending on List mutability, conversation message IDs may not be recorded, causing getMessagesByUser/getUserConversations to return incomplete data.",
    "checkAndAssignAdmin promotes the first authenticated caller to admin even without providing a valid admin secret token, undermining the intended token-gated admin bootstrap model.",
    "Therapy session requests are stored as Map<Principal, TherapySessionRequest>, so each user can only have one request; new submissions overwrite prior requests.",
    "adminConversations is never populated in the backend, so getAdminConversations will always return an empty list (and is currently unused by the frontend, which instead uses getAllMessages).",
    "CommunityPostCard always displays an “Anonymous” badge regardless of the post.anonymous flag, so non-anonymous posts are not visually distinguished.",
    "Several lists are sorted using Number(b.timestamp - a.timestamp) where timestamps are nanosecond bigints; converting large nanosecond values to Number can lose precision and may cause incorrect ordering.",
    "MessagesPage marks messages as read during render (inside the message map), which can trigger repeated backend writes and unpredictable behavior (especially under React strict-mode double-invocation).",
    "Blob storage cashier principal env var name is \"CAFFFEINE_STORAGE_CASHIER_PRINCIPAL\" (triple 'F'), which is likely a typo and can cause runtime traps if deployments use the expected spelling."
  ],
  "isFixRequest": false,
  "gameProjectType": "none",
  "projectName": "From Stigma to Support",
  "clarification_mode": "instant",
  "clarification_rounds": 0
}