{
  "schemaVersion": "1.0.0",
  "projectStateVersion": 3,
  "summary": "From Stigma to Support is an Internet Computer (ICP) mental-health and academic-wellness web application. A React (Tailwind/shadcn UI) SPA consumes a Motoko canister backend via an actor interface. Users authenticate with Internet Identity, complete a basic profile, and can use peer-support features such as an anonymous-capable community posting feed (with basic content filtering), mood tracking, and a stress self-assessment quiz with saved results. The app also provides static wellness resources (therapy techniques) and an emergency helpline/resources page. Authenticated users can exchange direct messages with polling-based updates and read receipts, while admins can view all messages. Admins additionally get an Outreach Dashboard for rural mental-health operations: reporting underserved areas, monitoring access levels, mapping institutions, scheduling outreach camps, viewing analytics, and visualizing coordinates on a simplified interactive map with external Google/Apple Maps links. The backend includes role-based access control and a blob-storage maintenance mixin for gateway authorization, dead-blob pruning, and cycles top-up operations.",
  "existing_features": [
    {
      "id": "IF-1",
      "title": "Internet Identity authentication (login/logout) with persisted sessions",
      "synonyms": [
        "ICP Internet Identity login",
        "AuthClient session"
      ],
      "description": "Users authenticate through Internet Identity using AuthClient. The provider loads an existing identity from storage on startup, exposes login/logout actions, and provides status flags for UI gating.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-2",
      "title": "Backend actor initialization (anonymous vs authenticated) and query invalidation on identity changes",
      "synonyms": [
        "Actor hook",
        "Authenticated/anonymous actor"
      ],
      "description": "Frontend creates an anonymous actor when logged out and an identity-bound actor when logged in. When the actor changes (e.g., identity changes), dependent react-query caches are invalidated/refetched to prevent stale data.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-3",
      "title": "Access-control bootstrap using admin token + user secret from URL hash",
      "synonyms": [
        "_initializeAccessControlWithSecret",
        "caffeineAdminToken"
      ],
      "description": "On authenticated actor creation, the frontend calls a backend initializer with a secret extracted from the URL hash/session. The backend compares the provided secret against an env var admin token to bootstrap the first admin; otherwise callers are registered as normal users.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-4",
      "title": "Role-based access control (admin/user/guest) and admin role assignment",
      "synonyms": [
        "RBAC",
        "AccessControl",
        "assignUserRole"
      ],
      "description": "Backend tracks user roles and enforces permissions for protected endpoints. Admins can assign roles to any principal; callers can check if they are admin.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-5",
      "title": "Admin auto-check/promotion flow with UI banner",
      "synonyms": [
        "checkAndAssignAdmin",
        "AdminPromotionBanner"
      ],
      "description": "After login, the frontend calls a backend method to confirm/potentially assign admin status, then refreshes admin state and displays an “Admin Mode Activated” banner/toast if promoted.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-6",
      "title": "User profile onboarding and storage",
      "synonyms": [
        "Profile setup dialog",
        "saveCallerUserProfile"
      ],
      "description": "Authenticated users create a basic profile (email, name, username, age). The UI validates fields and requires agreement to guidelines before saving; the profile can be retrieved later.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-7",
      "title": "User language preference (backend)",
      "synonyms": [
        "setUserLanguagePreference",
        "getUserLanguagePreference"
      ],
      "description": "Backend supports storing and retrieving a per-user language preference (e.g., English/Hindi/Spanish) as part of the user profile record.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-8",
      "title": "Community posts feed (list & create) with anonymity flag",
      "synonyms": [
        "Community Support page",
        "Anonymous posting"
      ],
      "description": "Users can create community posts with an anonymity toggle. The UI lists all posts and sorts by recency; posts include timestamp, author principal, and moderation flag.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-9",
      "title": "Community post editing and deletion with author/admin permissions",
      "synonyms": [
        "Edit post",
        "Delete post"
      ],
      "description": "Post authors can edit/delete their own posts; admins can edit/delete any post. UI conditionally shows actions and confirms deletions; backend enforces authorization.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-10",
      "title": "Community post moderation flagging (admin endpoint)",
      "synonyms": [
        "moderatePost",
        "Flagged posts"
      ],
      "description": "Backend supports an admin-only action to flag/unflag a post for moderation; posts contain a moderationFlag field that can be displayed in the UI.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-11",
      "title": "Content checking for posts (basic inappropriate-word filter)",
      "synonyms": [
        "checkContent",
        "Bad-words filter"
      ],
      "description": "Before creating or saving edits to community posts, the frontend calls a backend content-check method which rejects text containing configured bad words.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-12",
      "title": "Community guidelines retrieval and display",
      "synonyms": [
        "Guidelines page",
        "Safety rules"
      ],
      "description": "Frontend fetches a CommunityGuidelines object and renders core principles, acceptable conduct, prohibited behaviors, safety guidelines, and posting rules.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-13",
      "title": "Therapy & wellness resources hub (static content)",
      "synonyms": [
        "Therapy page",
        "Relaxation / art / music / physiotherapy resources"
      ],
      "description": "A tabbed UI provides wellness guidance across relaxation/breathing, art therapy, music therapy, and physiotherapy content.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-14",
      "title": "Therapy session request submission",
      "synonyms": [
        "createTherapySessionRequest",
        "Request Session dialog"
      ],
      "description": "Authenticated users can submit a therapy session request (type + details). Backend stores the request with a timestamp; admins can fetch all requests via an admin-only endpoint.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-15",
      "title": "Mood tracking (record mood and view history)",
      "synonyms": [
        "Mood Tracker",
        "Mood entries"
      ],
      "description": "Authenticated users can record a mood entry and view a list of recent mood entries with timestamps; UI provides predefined mood choices with icons and basic insights.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-16",
      "title": "Stress assessment quiz with saved results",
      "synonyms": [
        "Stress Quiz",
        "submitStressQuiz"
      ],
      "description": "Multi-step quiz captures responses, computes a score with guidance, and persists results in the backend so prior results can be displayed later.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-17",
      "title": "Emergency helpline and online resources page",
      "synonyms": [
        "Helpline page",
        "Crisis resources"
      ],
      "description": "Static page listing crisis helplines and online resources, with emergency disclaimers and outbound links.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-18",
      "title": "Direct messaging system with polling updates and read receipts",
      "synonyms": [
        "Messages",
        "DMs",
        "markMessageAsRead"
      ],
      "description": "Authenticated users can send messages to a principal, view messages grouped by conversation, and mark messages as read; UI polls periodically for new messages and shows sent-message read status.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-19",
      "title": "Admin global message visibility",
      "synonyms": [
        "All Messages (Admin)",
        "Message oversight"
      ],
      "description": "Admins can fetch and browse all messages system-wide in an admin-only view, including support-marked messages.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-20",
      "title": "Active user tracking and admin visibility",
      "synonyms": [
        "updateUserActivity",
        "getActiveUsers"
      ],
      "description": "Backend records per-user activity timestamps; admins can query active users. Frontend periodically refetches the active-user list for near-real-time monitoring.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-21",
      "title": "Unique login tracking and admin-only count",
      "synonyms": [
        "recordSuccessfulLogin",
        "getUniqueLoginsCount"
      ],
      "description": "On successful login, the frontend records a login event; admins can query and display the count of unique authenticated principals that have logged in.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-22",
      "title": "Rural area reporting and admin campaign updates",
      "synonyms": [
        "Reported areas",
        "reportArea",
        "updateAreaCampaigns"
      ],
      "description": "Users can report underserved regions (connectivity status, description, linked campaigns, support availability, coordinates). Admins can view reports and update linked campaigns per region.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-23",
      "title": "Institutional awareness mapping (admin CRUD) with coordinates",
      "synonyms": [
        "Institutions module",
        "addInstitution/updateInstitution"
      ],
      "description": "Admins can add and update institutions (type, region, contact info, infrastructure status, awareness rating, related campaigns, coordinates) for outreach planning and map visualization.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-24",
      "title": "Rural/low-access area monitoring (admin CRUD) with heatmap and map/list views",
      "synonyms": [
        "Area monitoring",
        "Heatmap visualization"
      ],
      "description": "Admins can add/update monitored areas (access level, connectivity, description, campaigns, coordinates). UI provides a heatmap-like visualization, plus map/list toggles and automatic fallback to list view on poor network strength.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-25",
      "title": "Offline outreach camp scheduling (admin CRUD) with clinician assignment",
      "synonyms": [
        "Outreach camps",
        "Camp scheduling"
      ],
      "description": "Admins can schedule and update outreach camps (dates, event type, status, optional clinician principal assignment, description, coordinates).",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-26",
      "title": "Outreach dashboard analytics & intelligence views (admin-only)",
      "synonyms": [
        "getDashboardAnalytics",
        "Intelligence dashboard"
      ],
      "description": "Backend provides aggregate metrics (institutions, monitored areas, camps, campaigns, awareness averages, distressed/low-access regions, upcoming events). The admin dashboard renders metrics, alerts, and recommendations.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-27",
      "title": "Interactive outreach map visualization with external map links",
      "synonyms": [
        "OutreachInteractiveMap",
        "Google/Apple Maps links"
      ],
      "description": "Frontend renders a simplified interactive map with markers for institutions, monitored areas, camps, and reported areas that have coordinates; supports selecting markers, a satellite/standard toggle, and opening in Google Maps or Apple Maps.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-28",
      "title": "Blob storage maintenance endpoints (gateway auth, dead-blob pruning, cycles top-up)",
      "synonyms": [
        "Caffeine storage mixin",
        "Dead blob GC",
        "Cashier refill"
      ],
      "description": "Backend includes a storage maintenance mixin to sync authorized gateway principals, list/prune dead blobs (with a GC trigger), check blob liveness, and top up cycles via a cashier principal guarded by env vars.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-29",
      "title": "SPA shell: navigation, gated routes, theming, and toasts",
      "synonyms": [
        "Header/Footer layout",
        "Manual routing",
        "Dark mode"
      ],
      "description": "App uses a shared layout with Header/Footer, state-based page navigation, auth/admin-gated nav items (Messages/Outreach), light/dark theming via next-themes, and global toast notifications via sonner.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-30",
      "title": "Website sharing dialog (available in footer)",
      "synonyms": [
        "ShareWebsiteDialog",
        "Social sharing"
      ],
      "description": "A dialog provides sharing actions for WhatsApp, Facebook, Twitter/X, and Instagram (copy link), opening platform-specific share URLs or copying the app URL to clipboard.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-31",
      "title": "Header share control removed while preserving header layout",
      "synonyms": [
        "Remove header share button",
        "REQ-1"
      ],
      "description": "The ShareWebsiteDialog trigger button is not rendered in the app header; the rest of the header layout and behavior remains unchanged.",
      "reqIds": [
        "REQ-1"
      ],
      "version": 1
    },
    {
      "id": "feature-update-the-community-page-so-that-admins-do-not-have-the-ability-to-edit-community-posts-via-the-ui-editing-should-be-allowed-only-for-the-original-post-author-authenticated-user-whose-principal-matches-post-author-while-delete-behavior-should-remain-unchanged-admins-can-still-delete-any-post-users-can-delete-their-own",
      "title": "Update the Community page so that admins do not have the ability to edit community posts via the UI. Editing should be allowed only for the original post author (authenticated user whose principal matches post.author), while delete behavior should remain unchanged (admins can still delete any post; users can delete their own).",
      "reqIds": [
        "REQ-2"
      ],
      "version": 1
    }
  ],
  "new_feature_requests": [
    {
      "id": "AR-1",
      "summary": "Remove the edit option for admins on community posts (admins should no longer be able to edit posts via the UI; keep other behavior unchanged).",
      "reqIds": [],
      "status": "pending"
    },
    {
      "id": "AR-2",
      "summary": "Remove the website sharing option (WhatsApp/Facebook/Instagram/Twitter/Messenger share controls) while keeping everything else unchanged.",
      "reqIds": [],
      "status": "pending"
    }
  ],
  "architectural_notes": [
    "ICP canister backend written in Motoko, exposing query/shared methods consumed by a React SPA through a generated actor interface.",
    "Authentication via Internet Identity (AuthClient/DelegationIdentity) provided as a React context with persisted identity loading on app startup.",
    "Frontend creates anonymous vs identity-bound actors; on authenticated actor creation it calls an access-control initialization method using an env-protected admin token and a user-provided secret pulled from the URL hash.",
    "Role-based access control (admin/user/guest) is centralized in an AccessControl module and enforced server-side (Runtime.trap on unauthorized).",
    "Data fetching and mutations use @tanstack/react-query with principal-scoped query keys and mutation-driven cache invalidation.",
    "Manual client-side routing is implemented with React state (no react-router), with auth/admin-gated navigation items in the Header.",
    "Near-real-time UX relies on polling (react-query refetchInterval) for messages and active-user lists.",
    "Admin Outreach Dashboard is a tabbed, dialog-driven CRUD + analytics UI, with map/list toggles and network-strength-based fallback behavior.",
    "UI stack uses TailwindCSS + shadcn/ui-style primitives, with theming via next-themes and toast notifications via sonner.",
    "Backend composes functionality via Motoko mixins (authorization mixin and a blob-storage maintenance mixin)."
  ],
  "known_issues": [
    "Backend addMoodEntry logic appears incorrect: it overwrites prior mood history (does not incorporate existing list) and duplicates the newly created entry.",
    "Messaging conversation indexing may be unreliable: sendMessage mutates an existing List without re-adding it to the userConversations map (depending on List semantics), potentially losing message IDs for existing users.",
    "Unique-login tracking may not persist as intended: uniqueLoginSet is declared as a let Set and is updated via uniqueLoginSet.add(...) without assignment (depending on Set mutability/semantics).",
    "checkAndAssignAdmin can self-assign the first authenticated caller as admin even without supplying the intended admin secret token, undermining token-gated admin bootstrap.",
    "MessagesPage marks messages as read during render (inside the map loop), which can trigger repeated backend writes and unpredictable behavior (especially under React strict-mode).",
    "CommunityPostCard always displays an “Anonymous” badge regardless of the post.anonymous flag, so non-anonymous posts are not visually distinguished.",
    "Several UI sorts compute Number(bigintTimestampDifference); converting large nanosecond timestamps to Number can lose precision and cause incorrect ordering.",
    "getAllCommunityPosts is publicly queryable (no auth check); if posts are intended to be private to authenticated users, this is a privacy mismatch.",
    "ShareWebsiteDialog includes a Messenger share URL with placeholder app_id (\"YOUR_APP_ID\"), so that path is not functional as-is.",
    "Blob-storage cashier env var name is \"CAFFFEINE_STORAGE_CASHIER_PRINCIPAL\" (triple 'F'), which is likely a typo and can cause deployment/runtime configuration issues."
  ],
  "isFixRequest": false,
  "generatedImages": [],
  "gameProjectType": "none",
  "projectName": "From Stigma to Support",
  "clarification_mode": "instant",
  "clarification_rounds": 0
}